7Ji/esp8266-temp-monitor-and-pc-reset/src/main.cpp
#include <Arduino.h>
#include <DHT.h>
#include <ESP8266WebServer.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>

static_assert(sizeof(unsigned long) == sizeof(uint32_t), "unsigned long (would return by millis) is not 32 bit");

#include "root.html.h"

#define COMPCONST static inline constexpr

COMPCONST char const ConfigHostName[] = PRIVATE_HOSTNAME;
COMPCONST char const ConfigWiFiSSID[] = PRIVATE_WIFI_SSID;
COMPCONST char const ConfigWiFiPassword[] = PRIVATE_WIFI_PASSWORD;
COMPCONST unsigned long const ConfigBaudRate = 115200;

COMPCONST char const ErrorStringWouldTruncate[] PROGMEM = "String Would Truncate";
COMPCONST char const ErrorStringFormatFailure[] PROGMEM = "String Format Failure";
COMPCONST char const ErrorNotFound[] PROGMEM = "Not Found";
COMPCONST char const PcPowerOk[] PROGMEM = "Power button pulse sent";
COMPCONST char const PcResetOk[] PROGMEM = "Reset button pulse sent";

COMPCONST unsigned long const OneSecondAsMs = 1'000;
COMPCONST uint8_t const MaxWaits = 20;
COMPCONST uint8_t const PcPinPower =
#ifdef PRIVATE_PIN_POWER
PRIVATE_PIN_POWER
#else
D1
#endif
;
COMPCONST uint8_t const PcPinReset =
#ifdef PRIVATE_PIN_RESET
PRIVATE_PIN_RESET
#else
D2
#endif
;
static DHT dht(
#ifdef PRIVATE_PIN_DHT11
PRIVATE_PIN_DHT11
#else
D4
#endif
, DHT11);
static ESP8266WebServer server(80);

#define serverSendError(x) server.send_P(500, "text/plain", Error ## x, sizeof(Error ## x) - 1)

struct UpTimer {
  COMPCONST uint32_t const MillisSafeMax = UINT32_MAX - OneSecondAsMs;

  uint32_t secondsOffset = 0;
  uint32_t millisOffset = 0;
  uint32_t millisLast = 0;

  void tick(uint32_t const millisCurrent) {
    if (millisCurrent < millisLast) { /* overflow */
      /* UINT32_MAX = 0xFFFFFFFF = 4294967295 */
      secondsOffset += 4294967;
      millisOffset += 295;
      while (millisOffset >= OneSecondAsMs) {
        millisOffset -= OneSecondAsMs;
        secondsOffset += 1;
      }
    }
  }

  uint32_t upSeconds(uint32_t const millisCurrent) const {
    return secondsOffset + (millisCurrent + (millisCurrent > MillisSafeMax ? 0 : millisOffset)) / OneSecondAsMs;
  }
};

static UpTimer upTimer = {};

struct NtpSyncer {
  COMPCONST uint32_t const MinInterval = 3600000UL;
  COMPCONST uint32_t const NtpUnixOffset = 2208988800UL;
  COMPCONST uint32_t const MinUnixOffset = 1776133834UL; /* Tue Apr 14 11:00:01 CST 2026, no specific reason */
  COMPCONST uint32_t const MinNtp = NtpUnixOffset + MinUnixOffset;

  COMPCONST char NtpServer[] =
#ifdef PRIVATE_NTP_SERVER
    PRIVATE_NTP_SERVER
#else
    "pool.ntp.org"
#endif
      ;
  COMPCONST uint16_t const UdpPortNtp =
#ifdef PRIVATE_NTP_LOCAL_PORT
    PRIVATE_NTP_LOCAL_PORT
#else
    7931 /* This is chosen simply randomly */
#endif
      ;

  IPAddress serverIP;
  WiFiUDP udp;
  byte buffer[48];
  uint32_t millisLast;
  bool init, isIP;

  uint64_t unixOffset = MinUnixOffset;

  void update(uint32_t const millisCurrent) {
    uint8_t i;
    uint32_t ntpOffset, naiveUnixOffset;

    if (!init) {
      if (!udp.begin(UdpPortNtp)) {
        Serial.printf("Failed to listen on %" PRIu16 "\n", UdpPortNtp);
        return;
      }
      if (serverIP.fromString(NtpServer)) {
        isIP = true;
      }
      init = true;
    }
    if (!isIP) {
      if (!WiFi.hostByName(NtpServer, serverIP, 1000)) {
        Serial.printf("Failed to resolve '%s' to IP\n", NtpServer);
        return;
      }
    }
    if (!udp.beginPacket(serverIP, 123)) {
      Serial.println("Failed to begin NTP packet");
      return;
    }
    buffer[0] = 0b11100011;
    memset(buffer + 1, 0, sizeof(buffer) - 1);
    if (udp.write(buffer, sizeof(buffer)) != sizeof(buffer)) {
      Serial.println("Failed to write whole NTP packet");
      return;
    }
    if (!udp.endPacket()) {
      Serial.println("Failed to end UDP packet");
      return;
    }
    for (i = 0;;) {
      if (udp.parsePacket()) {
        break;
      }
      delay(100);
      if (++i > 20) {
        Serial.println("Timeout waiting for NTP response");
        return;
      }
    }
    if (udp.read(buffer, sizeof buffer) != sizeof buffer) {
      Serial.println("Failed to read NTP response");
      return;
    }
    ntpOffset = ((uint32_t(word(buffer[40], buffer[41])) << 16) | word(buffer[42], buffer[43]));

    naiveUnixOffset = ntpOffset - NtpUnixOffset;
    if (ntpOffset < MinNtp) {
      Serial.printf("NTP offset %" PRIu32 " < minimum NTP %" PRIu32 ", adding one era\n", ntpOffset, MinNtp);
      unixOffset = 0x100000000ULL + naiveUnixOffset;
    } else {
      unixOffset = naiveUnixOffset;
    }
    unixOffset -= upTimer.upSeconds(millisCurrent);
    millisLast = millisCurrent;
    Serial.printf("Current unix offset is %" PRIu64 "\n", unixOffset);
  }

  void firstUpdate(uint32_t const millisCurrent) {
    update(millisCurrent);
  }

  void maybeUpdate(uint32_t const millisCurrent) {
    /* Force update if not initialized yet, or */
    if ((millisCurrent - millisLast) >= MinInterval || !init) {
      update(millisCurrent);
    }
  }
};

static NtpSyncer ntpSyncer = {};

struct SensorRecord {
  COMPCONST int const lenBuffer = 38; /* extreme 18446744073709551615,255.255,255.255\n */
  COMPCONST int const lenBufferShort = 16; /* extreme 255.255,255.255\0 */

  uint32_t timestamp; /* second */
  int8_t tempInt;
  uint8_t tempDot;
  uint8_t humidInt;
  uint8_t humidDot;

  /* buffer should be at least lenBuffer */
  bool intoStr(uint64_t const unixOffset, char *const buffer, size_t &len) const {
    int const r = snprintf(buffer, lenBuffer, "%" PRIu64 ",%" PRId8 ".%" PRIu8 ",%" PRIu8 ".%" PRIu8 "\n", unixOffset + timestamp, tempInt, tempDot, humidInt, humidDot);

    if (r < 0) {
      serverSendError(StringFormatFailure);
      return false;
    } else if (r >= lenBuffer) {
      serverSendError(StringWouldTruncate);
      return false;
    } else {
      len = r;
      return true;
    }
  }
};

static_assert(sizeof(struct SensorRecord) == 8, "SensorRecord should have a size of 4");

struct SensorSlice {
  COMPCONST uint32_t const Magic = 0x82660C05;
  COMPCONST uint16_t const MaxRecords = 30;
  COMPCONST uint16_t const MaxRecordsSub1 = MaxRecords - 1;
  COMPCONST uint16_t const CountChecksum32 = (MaxRecords + 1) * 2;
  COMPCONST uint16_t const CountAll32 = MaxRecords + 2;

  uint32_t magic = Magic;
  uint32_t checksum;
  uint64_t unixOffset;
  SensorRecord records[MaxRecords];

